mailService/src/main/synapse-config/proxy-services/correios.xml

<?xml version="1.0" encoding="UTF-8"?>
<proxy name="correios" startOnLoad="true" transports="https http" xmlns="http://ws.apache.org/ns/synapse">
    <target>
        <inSequence>
            <payloadFactory description="envelopIn" media-type="xml">
                <format>
                    <soapenv:Envelope xmlns:cli="http://cliente.bean.master.sigep.bsb.correios.com.br/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
                        <soapenv:Header/>
                        <soapenv:Body>
                            <cli:consultaCEP>
                                <cep xmlns="">$1</cep>
                            </cli:consultaCEP>
                        </soapenv:Body>
                    </soapenv:Envelope>
                </format>
                <args>
                    <arg evaluator="xml" expression="$url:cep"/>
                </args>
            </payloadFactory>
            <header action="remove" name="Action" scope="default"/>
            <property action="remove" name="SOAPAction" scope="transport"/>
            <send>
                <endpoint>
                    <address format="soap11" uri="https://apps.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente"/>
                </endpoint>
            </send>
        </inSequence>
        <outSequence>
            <property name="messageType" scope="axis2" type="STRING" value="application/json"/>
            <send/>
        </outSequence>
        <faultSequence>
            <send/>
        </faultSequence>
    </target>
</proxy>
